---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ContentNode
source: html/813f1851-4cc0-b47b-c3a9-0083dc6db091.htm
---
# ContentNode Members

Returns an an instance of an Asset object, which contains definitions of the content node.